# Panda "Series"

Pandas stands for "Pan"el "Da"ta Library.
The Panda "series" is built on NumPy arrays.

The difference is that "series" can have named indexes and called values based on that name (we can still call data with a numerical index).

In [2]:
import numpy as np ### Create some data
import pandas as pd

In [3]:
### Check different ways we can create series:

In [4]:
labels = ['a','b','c'] ### Create a list of labels

In [5]:
mylist = [10,20,30] ### Creat a array

In [6]:
arr = np.array(mylist) ### Convert to NumPy array

In [7]:
arr

array([10, 20, 30])

In [8]:
### Creating a dictionary object
### Dictionaries are used to store data values in key:value pairs.
### A dictionary is a collection which is ordered*, changeable and do not allow duplicates.

d = {'a':10, 'b':20, 'c':30}

In [9]:
### pd.Series -> shift + tab keys
### it takes data and index

pd.Series(data=mylist)

### Note: it automatically match values and corresponding indexes (similar to NumPy array)

# pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [10]:
pd.Series(data=arr, index = labels)

### We can see series is now named. e,g., company a and correspinding number of employees

a    10
b    20
c    30
dtype: int32

In [11]:
### Note: data type can be anything (No issue with Panda)

pd.Series(data=[10,'a','30'])

0    10
1     a
2    30
dtype: object

In [12]:
### Thus, Panda series is essentially NumPy array with named index.

In [13]:
ser1 = pd.Series(data = [1,2,3,4], index = ['USA', 'Germany' , 'USSR', 'Japan'])

In [14]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [15]:
### If I want to find the corresponding value, I do not need to remember the index. Just call the value
ser1['USA']

1

In [16]:
ser2 = pd.Series(data = [1,4,5,6], index = ['USA', 'Germany' , 'Italy', 'Japan'])

In [17]:
ser2

USA        1
Germany    4
Italy      5
Japan      6
dtype: int64

In [18]:
### Pandas can perform operations on multiple series
ser1 + ser2

### It will add matching values (additional note: Everything changed to float)

Germany     6.0
Italy       NaN
Japan      10.0
USA         2.0
USSR        NaN
dtype: float64

### Dataframes - Part One

A dataframe is multiple series that share the same index (named or default index).

In [20]:
#import pandas as pd
#import numpy as np ## To create random numbers

In [21]:
### Create random numbers

from numpy.random import randn
np.random.seed(101)
rand_mat = randn(5,4)

In [22]:
rand_mat

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [23]:
### Construct a dataframe

### pd.DataFrame shift key + tab key
### similar to pd.Series, we have "data" and "index" arguments. We also have the "columns" argument

df = pd.DataFrame(data = rand_mat) 
df
### This produces a dataframe with automatic indexes (label indices)

          0         1         2         3
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [24]:
### Notes: Quick way to break strings separate with spaces
'A B C D E'.split() ### This helps to create quick named indexes

['A', 'B', 'C', 'D', 'E']

In [25]:
df = pd.DataFrame(data = rand_mat, index = 'A B C D E'.split()) 
df

### Now we have named indexes. We can do the same for columns

          0         1         2         3
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df = pd.DataFrame(data = rand_mat, index = 'A B C D E'.split(), columns = 'W X Y Z'.split()) 
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
### Selecting data from this dataframe.
### It is very similar to collecting data from a numpy array

### Selecting data from a single column
df['W']

### type(df['W'])
### Type has not changed. It is still a series.

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [28]:
### Selecting data from multiple columns
mylist = ['W','Y']
df[mylist] ### Returns a dataframe. Note: Jupyter notebook gives a nice output.

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [29]:
### Alternatively
df[['W','Y']]

### Note: We can also chnage the order (if needed)

#df[['Y', 'W']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [30]:
### Similar to SQL, we can access the columns by using the command "df.W" (Note: This command works here too).
### But it is not recommended as dataframes have different attributes, and this might get confused with them.

### Example
df.all

<bound method DataFrame.all of           W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509>

In [31]:
### df['NEW']
### IF we run the above command, we will get an error as there is no column named "NEW"
### But we can use this to create a new column in our dataframe

df['NEW'] = df['W'] + df['Y']
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [32]:
### How to remove a column?

In [33]:
# df.drop('NEW')

### The above code gives an error. This mean we are passing wrong axis or wrong name.
### We can use df.drop to drop both rows and columns
### df.drop('NEW', axis=0) == by default (i.e., for rows)

df.drop('NEW', axis=1)

### Note: This removal is temporary

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
### When print 'df' dataframe, the 'NEW' columns is still there
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [35]:
df.drop('NEW', axis=1, inplace=True) ### inplace' will make sure change is permanant

In [36]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
### How to remove a row?

In [38]:
df.drop('A') 

### Mention the row, which you want to drop
### Thus, df.drop works for both rows and columns. Note: This drop in not permanant.

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
### Selecting rows

In [40]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [42]:
### Since it remebers the original index of the rows, we can use that to select rows.
df.iloc[0] ### Index zero for first row

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [43]:
### Selecting multiple rows

df.loc[['A','B']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [44]:
### Alternatively

df.iloc[[0,1]]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [45]:
### How to grab specific set of values? 

### Example: columns 'Y' and 'Z' with rows 'A' and 'B'

df.loc[['A','B']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [46]:
df.loc[['A','B']][['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

In [47]:
### Alternatively:
df.loc[['A','B'],['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

### DataFrames - Part Two

In [49]:
### Let I want to see which values are positive in my dataframe.

df > 0

### This is a datframe with boolian

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [50]:
df_bool = df > 0

In [51]:
df[df_bool]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
### Typically this is done in one step

df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [53]:
### It is typically to filter based on values in a single column

### Example: Let I want to select rows where values in column 'W' are positive

df['W'] > 0

### This returns which rows in column 'W' are positive

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [54]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [55]:
### Let's say we want to further extend the selection by just selecting the column 'Y'

df[df['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [56]:
### Further:

df[df['W']>0]['Y'].loc['A']

0.9079694464765431

In [57]:
### Use two conditions

cond1 = df['W'] > 0
cond2 = df['Y'] > 1

### df[cond1 and cond2]

### Above code will give an error. Because 'and' 'or' key words in Python are not design to for series.
### Thus, we need to modify this for Python

In [58]:
df[(cond1) & (cond2)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [59]:
### Alternatively:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [60]:
### Extra Notes: Let we want to count number of values of a certain column satisfy a certain condition

df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [61]:
ser_w = df['W']>0
ser_w.value_counts()

W
True     4
False    1
Name: count, dtype: int64

In [62]:
### Alternatively:

sum(ser_w)

4

In [63]:
### Find the length
len(ser_w)

5

In [64]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [65]:
### Let I want A, B, C, D, E to be a column

df.reset_index()

### By default Panda naming the column 'index'
### Also, we can make this permanant by using 'inplace' argument

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [66]:
### Set a selected column to be the index

new_ind = 'CA NY WY OR CO'.split()
new_ind

['CA', 'NY', 'WY', 'OR', 'CO']

In [67]:
df['States'] = new_ind

In [68]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [69]:
### I want 'States' column to be the index column

df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [70]:
### This is not permanant. We can make it permanant with 'inplace'

df.set_index('States', inplace=True)

In [71]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [72]:
### Get summaries of the Dataframe

df.info()

### This gives information about the columns

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [73]:
df.dtypes

### This shows data type of each column

W    float64
X    float64
Y    float64
Z    float64
dtype: object

In [74]:
df.describe()

### This gives summary statistics for each column (mean, standard deviation, five-number summary)

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.343858  0.453764  0.452287  0.431871
std    1.681131  1.061385  1.454516  0.594708
min   -2.018168 -0.758872 -0.933237 -0.589001
25%    0.188695 -0.319318 -0.848077  0.503826
50%    0.190794  0.628133  0.528813  0.605965
75%    0.651118  0.740122  0.907969  0.683509
max    2.706850  1.978757  2.605967  0.955057

### Missing Data with Pandas

In many cases, we may observe data with missing vlaues. What should we do in such cases?

Three options:
1. keep the missing data (NaN)
2. Drop the missing data (drop entire row including the timestamp)
3. Fil the missing data with some value (best estimated guess)

Note that there is no correct apporach here.

Fortunately, time series data rarely have missing values. Because we use some sort of a system to timestamp a certain event. Example: Stock prices

Anyway, we are going to see some methods in Python to handle missing values in our data.

In [76]:
### import numpy as np
### import pandas as pd

In [77]:
### Let's create a dataframe with some missing values

df = pd.DataFrame({'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]})

In [78]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [79]:
### Let's assume all three options for handling missing values are avaibale to us

In [80]:
### Option 2: Drop missing values (drop entire row, that is axis = 0)

df.dropna()

     A    B  C
0  1.0  5.0  1

In [81]:
### Option 2: Drop missing vlaues (drop entire column)
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [82]:
### Specify a paramter when dropping missing values

df.dropna(thresh=2) ### we drop a row when there are more than 2 missing values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [83]:
### Option 3: Fill missing values (with a given value)

df.fillna(value='FILL VALUE') ### fill missing values with "FILL VALUE"

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [84]:
### Option 3: Fill missing values (with a method (mean value))

df.mean()

A    1.5
B    5.0
C    2.0
dtype: float64

In [85]:
df.fillna(df.mean())

### Alternative: df.fillna(value=df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [86]:
### We can fill missing values in a certain column

df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### Group By Operations

Aften you may want to perform as analysis based on values of a specific column. That is, you want to group other columns based on another. This requires 3 steps:
1. Split the data / group them
2. Apply some functions to the split groups
3. combine data back to a single dataframe

Pandas does this in background using the method: '.groupby()'

In [88]:
### import pandas as pd

### Create a dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [89]:
df = pd.DataFrame(data)

In [90]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [91]:
df.groupby('Company')

### With the above code, we can already split the data.
### Since we did not perform any function on the data, it is temporarily saved in the system.

In [92]:
#dfgroup = df.groupby('Company')

#dfgroup.mean()

### Note: In the resulting dataframe, 'Company' is the index. That is why 'Company' and 'Sales' are in two different levels.

In [93]:
df.groupby('Company').describe() ### Summary Statistics

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [94]:
### Alternatively:

df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

### Common Operations

Below we discuss more operations which are important for Series and Dataframes in Pandas

In [96]:
### import pandas as pd

df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,555,666,444],
                  'col3':['abc','def','ghi','xyz']})

df.head() ### Show head of the dataframe 'df'

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [97]:
### Identify unique values in a column

df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [98]:
### Number of unique values in a column

df['col2'].nunique()

3

In [99]:
### Number of instances of unique values

df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [100]:
### Selecting values based on conditions on multiple columns

In [101]:
# col1 > 2
# col2 == 444

newdf = df[(df['col1']>2) & (df['col2']==444)] ### for OR condition use "|"
newdf

   col1  col2 col3
3     4   444  xyz

In [102]:
### Create a function and apply to every column

In [103]:
### Define a new function to multiply a number by two

def times_two(number):
    return number*2

In [104]:
### Use user user-defined function
times_two(4)

8

In [105]:
### Apply the function to a certain column

df['col1'].apply(times_two)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [106]:
### It is very common to add this modified data as a new column to the existing dataframe

df['new'] = df['col1'].apply(times_two)

df

   col1  col2 col3  new
0     1   444  abc    2
1     2   555  def    4
2     3   666  ghi    6
3     4   444  xyz    8

In [107]:
### Permanantly delete a column

del df['new']

df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [108]:
### Alternatively: df.drop()

In [109]:
### Get column name

df.columns ### no '()' after columns because it is an attribute

Index(['col1', 'col2', 'col3'], dtype='object')

In [110]:
### Get Index infomation

df.index

RangeIndex(start=0, stop=4, step=1)

In [111]:
### Sort data based a values of a specific column

df.sort_values('col2')

### By default it is sorting values in ascending order

### df.sort_values('col2',ascending=False)

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

### Data Inputs and Output

Pandas can read a variety of tabular data formats (read from and write to). Search Google for "Pandas IO."

Let's look at a couple of examples below.

In [113]:
###import pandas as pd

### Before importing the data, it is important to note where my data file is and the location of the notebook.
### We can figure out the location of the notebook, type 'pwd'

#pwd

#### csv input

You may need to install <tt>xlrd</tt> and <tt>openpyxl</tt>.<br>
In your terminal/command prompt run:

    conda install xlrd
    conda install openpyxl

Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution)

In [115]:
### Now let's read dafa from a CSV file

pd.read_csv('Chapter_2_Pandas_CSV_Example.csv')

### Note: Here location of the notebook and the CSV file paths are the same. So we can just mention the CSV file name.
### Otherwise, we have to give the entire file path for the CSV file.
### eg., pd.read_csv('c:\\Users\\...\\example.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [116]:
### Save as a dataframe

df = pd.read_csv('Chapter_2_Pandas_CSV_Example.csv')

df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [117]:
### Let's say we want to save a dataframe, then

newdf = df[['a','b']]

newdf

newdf.to_csv('Chapter_2_Pandas_mynew.csv') ### When typing the file name press tab. It will fill out the rest of the file name.

### If you do not want to save the index:
###newdf.to_csv('mynew.csv', index = False)

In [118]:
### Read an Excel file

pd.read_excel('Chapter_2_Pandas_Excel_Sample.xlsx')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [119]:
### From an Excel file, we can read a specific sheet

pd.read_excel('Chapter_2_Pandas_Excel_Sample.xlsx', sheet_name = 'Sheet1') ### It can take only one sheet at a time.

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [120]:
df = pd.read_excel('Chapter_2_Pandas_Excel_Sample.xlsx', sheet_name = 'Sheet1')

### Note you may or may not get a column called 'Unnamed: 0'
### We can remove it after checking the column names
df.columns

### df.drop('Unnamed: 0', axis = 1)

Index(['Unnamed: 0', 'a', 'b', 'c', 'd'], dtype='object')

In [121]:
### Note: This allow to read a csv and Excel file where data are in tabeular form.
### Note: different color codings, macros, fromulars

#### HTML Input

Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects.

You may need to install <tt>lxml</tt>, <tt>htmllib5</tt>, and <tt>BeautifulSoup4</tt>.<br>
In your terminal/command prompt run:

    conda install lxml
    conda install html5lib
    conda install beautifulsoup4

Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution)

In [123]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html') ### With a firewall, you may or may not be able to read this.

### This webpage table contains the failed bank list

type(df)

### Note that this is a 'list'

list

In [124]:
### let's check the length of the list

len(df)

### Length of the list is 1. That is, there is only one table there.

1

In [125]:
df[0] ### Print the first table

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
1,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
2,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,First Bank & Trust Co.,"October 18, 2024",10547
3,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
4,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
5,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
6,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
7,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
8,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
9,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
10,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
11,The First State Bank,Barboursville,West Virginia,14361,"MVB Bank, Inc.","April 3, 2020",10536
12,Ericson State Bank,Ericson,Nebraska,18265,Farmers and Merchants Bank,"February 14, 2020",10535
13,City National Bank of New Jersey,Newark,New Jersey,21111,Industrial Bank,"November 1, 2019",10534
14,Resolute Bank,Maumee,Ohio,58317,Buckeye State Bank,"October 25, 2019",10533
15,Louisa Community Bank,Louisa,Kentucky,58112,Kentucky Farmers Bank Corporation,"October 25, 2019",10532
16,The Enloe State Bank,Cooper,Texas,10716,"Legend Bank, N. A.","May 31, 2019",10531
17,Washington Federal Bank for Savings,Chicago,Illinois,30570,Royal Savings Bank,"December 15, 2017",10530
18,The Farmers and Merchants State Bank of Argonia,Argonia,Kansas,17719,Conway Bank,"October 13, 2017",10529
19,Fayette County Bank,Saint Elmo,Illinois,1802,"United Fidelity Bank, fsb","May 26, 2017",10528
20,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,Wisconsin,30003,First-Citizens Bank & Trust Company,"May 5, 2017",10527
21,First NBC Bank,New Orleans,Louisiana,58302,Whitney Bank,"April 28, 2017",10526
22,Proficio Bank,Cottonwood Heights,Utah,35495,Cache Valley Bank,"March 3, 2017",10525
23,Seaway Bank and Trust Company,Chicago,Illinois,19328,State Bank of Texas,"January 27, 2017",10524
24,Harvest Community Bank,Pennsville,New Jersey,34951,First-Citizens Bank & Trust Company,"January 13, 2017",10523